/*
#############################################################################################
# Mass Effect 2 (1.2.1604.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Engine_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_TRACEFLAG_Bullet                                   1
#define CONST_TRACEFLAG_PhysicsVolumes                           2
#define CONST_TRACEFLAG_SkipMovers                               4
#define CONST_TRACEFLAG_Blocking                                 8
#define CONST_REP_RBLOCATION_ERROR_TOLERANCE_SQ                  16.0f
#define CONST_MINFLOORZ                                          0.7
#define CONST_ACTORMAXSTEPHEIGHT                                 35.0
#define CONST_RBSTATE_LINVELSCALE                                10.0

	LINKED_MAX                                         = 3
};*/

// Enum Engine.UIList.ECellAutoSizeMode
/*enum ECellAutoSizeMode
{
	CELLAUTOSIZE_None                                  = 0,
	CELLAUTOSIZE_Uniform                               = 1,
	CELLAUTOSIZE_Constrain                             = 2,
	CELLAUTOSIZE_AdjustList                            = 3,
	CELLAUTOSIZE_MAX                                   = 4
};*/

// Enum Engine.UIContextMenu.EContextMenuItemType
/*enum EContextMenuItemType
{
	CMIT_Normal                                        = 0,
	CMIT_Submenu                                       = 1,
	CMIT_Separator                                     = 2,
	CMIT_Check                                         = 3,
	CMIT_Radio                                         = 4,
	CMIT_MAX                                           = 5
};*/

// Enum Engine.UIDataStore_OnlineStats.EStatsFetchType
/*enum EStatsFetchType
{
	SFT_Player                                         = 0,
	SFT_CenteredOnPlayer                               = 1,
	SFT_Friends                                        = 2,
	SFT_TopRankings                                    = 3,
	SFT_MAX                                            = 4
};*/

// Enum Engine.UIFrameBox.EFrameBoxImage
/*enum EFrameBoxImage
{
	FBI_TopLeft                                        = 0,
	FBI_Top                                            = 1,
	FBI_TopRight                                       = 2,
	FBI_CenterLeft                                     = 3,
	FBI_Center                                         = 4,
	FBI_CenterRight                                    = 5,
	FBI_BottomLeft                                     = 6,
	FBI_Bottom                                         = 7,
	FBI_BottomRight                                    = 8,
	FBI_MAX                                            = 9
};*/

// Enum Engine.UISafeRegionPanel.ESafeRegionType
/*enum ESafeRegionType
{
	ESRT_FullRegion                                    = 0,
	ESRT_TextSafeRegion                                = 1,
	ESRT_MAX                                           = 2
};*/

// Enum Engine.UITabControl.EUITabAutosizeType
/*enum EUITabAutosizeType
{
	TAST_Manual                                        = 0,
	TAST_Fill                                          = 1,
	TAST_Auto                                          = 2,
	TAST_MAX                                           = 3
};*/

// Enum Engine.Weapon.EWeaponFireType
/*enum EWeaponFireType
{
	EWFT_InstantHit                                    = 0,
	EWFT_Projectile                                    = 1,
	EWFT_Custom                                        = 2,
	EWFT_None                                          = 3,
	EWFT_MAX                                           = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class Engine.BioGlobalObjectContainer
// 0x0018 (0x0054 - 0x003C)
class UBioGlobalObjectContainer : public UObject
{
public:
	struct FName                                       PackageName;                                      		// 0x003C (0x0008) [0x0000000000000000]              
	class UPackage*                                    LoadedPackage;                                    		// 0x0044 (0x0004) [0x0000000000000000]              
	TArray< class UObject* >                           LoadedObjects;                                    		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 50 ];

		return pClassPointer;
	};

};

UClass* UBioGlobalObjectContainer::pClassPointer = NULL;

// Class Engine.Engine
// 0x03D4 (0x0414 - 0x0040)
class UEngine : public USubsystem
{
public:
	class UFont*                                       TinyFont;                                         		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FString                                     TinyFontName;                                     		// 0x0044 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UFont*                                       SmallFont;                                        		// 0x0050 (0x0004) [0x0000000000000000]              
	struct FString                                     SmallFontName;                                    		// 0x0054 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UFont*                                       MediumFont;                                       		// 0x0060 (0x0004) [0x0000000000000000]              
	struct FString                                     MediumFontName;                                   		// 0x0064 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UFont*                                       LargeFont;                                        		// 0x0070 (0x0004) [0x0000000000000000]              
	struct FString                                     LargeFontName;                                    		// 0x0074 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	TArray< class UFont* >                             AdditionalFonts;                                  		// 0x0080 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           AdditionalFontNames;                              		// 0x008C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UClass*                                      ConsoleClass;                                     		// 0x0098 (0x0004) [0x0000000000000000]              
	struct FString                                     ConsoleClassName;                                 		// 0x009C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UClass*                                      GameViewportClientClass;                          		// 0x00A8 (0x0004) [0x0000000000000000]              
	struct FString                                     GameViewportClientClassName;                      		// 0x00AC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UClass*                                      DataStoreClientClass;                             		// 0x00B8 (0x0004) [0x0000000000000000]              
	struct FString                                     DataStoreClientClassName;                         		// 0x00BC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UClass*                                      LocalPlayerClass;                                 		// 0x00C8 (0x0004) [0x0000000000000000]              
	struct FString                                     LocalPlayerClassName;                             		// 0x00CC (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UMaterial*                                   DefaultMaterial;                                  		// 0x00D8 (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultMaterialName;                              		// 0x00DC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   WireframeMaterial;                                		// 0x00E8 (0x0004) [0x0000000000000000]              
	struct FString                                     WireframeMaterialName;                            		// 0x00EC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   EmissiveTexturedMaterial;                         		// 0x00F8 (0x0004) [0x0000000000000000]              
	struct FString                                     EmissiveTexturedMaterialName;                     		// 0x00FC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   GeomMaterial;                                     		// 0x0108 (0x0004) [0x0000000000000000]              
	struct FString                                     GeomMaterialName;                                 		// 0x010C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   DefaultFogVolumeMaterial;                         		// 0x0118 (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultFogVolumeMaterialName;                     		// 0x011C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   TickMaterial;                                     		// 0x0128 (0x0004) [0x0000000000000000]              
	struct FString                                     TickMaterialName;                                 		// 0x012C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   CrossMaterial;                                    		// 0x0138 (0x0004) [0x0000000000000000]              
	struct FString                                     CrossMaterialName;                                		// 0x013C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   VisColorationMaterialInChunk;                     		// 0x0148 (0x0004) [0x0000000000000000]              
	struct FString                                     VisColorationMaterialInChunkName;                 		// 0x014C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   VisColorationMaterialLoadChunk;                   		// 0x0158 (0x0004) [0x0000000000000000]              
	struct FString                                     VisColorationMaterialLoadChunkName;               		// 0x015C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   VisColorationMaterialVisibleChunk;                		// 0x0168 (0x0004) [0x0000000000000000]              
	struct FString                                     VisColorationMaterialVisibleChunkName;            		// 0x016C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   VisColorationMaterialMasterMap;                   		// 0x0178 (0x0004) [0x0000000000000000]              
	struct FString                                     VisColorationMaterialMasterMapName;               		// 0x017C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   VisColorationMaterialUnloaded;                    		// 0x0188 (0x0004) [0x0000000000000000]              
	struct FString                                     VisColorationMaterialUnloadedName;                		// 0x018C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   BioColorChunkMaterial;                            		// 0x0198 (0x0004) [0x0000000000000000]              
	struct FString                                     BioColorChunkMaterialName;                        		// 0x019C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   BioTranslucentVolumeMaterial;                     		// 0x01A8 (0x0004) [0x0000000000000000]              
	struct FString                                     BioTranslucentVolumeMaterialName;                 		// 0x01AC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	unsigned char                                      BioUnTexCompressSetting;                          		// 0x01B8 (0x0001) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	unsigned char                                      TransitionType;                                   		// 0x01B9 (0x0001) [0x0000000000000000]              
	class UMaterial*                                   LevelColorationLitMaterial;                       		// 0x01BC (0x0004) [0x0000000000000000]              
	struct FString                                     LevelColorationLitMaterialName;                   		// 0x01C0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   LevelColorationUnlitMaterial;                     		// 0x01CC (0x0004) [0x0000000000000000]              
	struct FString                                     LevelColorationUnlitMaterialName;                 		// 0x01D0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   RemoveSurfaceMaterial;                            		// 0x01DC (0x0004) [0x0000000000000000]              
	struct FString                                     RemoveSurfaceMaterialName;                        		// 0x01E0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	TArray< struct FColor >                            LightComplexityColors;                            		// 0x01EC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	TArray< struct FColor >                            ShaderComplexityColors;                           		// 0x01F8 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	unsigned long                                      bUsePixelShaderComplexity : 1;                    		// 0x0204 (0x0004) [0x0000000000044000] [0x00000001] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bUseAdditiveComplexity : 1;                       		// 0x0204 (0x0004) [0x0000000000044000] [0x00000002] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bUseSound : 1;                                    		// 0x0204 (0x0004) [0x0000000000004001] [0x00000004] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseTextureStreaming : 1;                         		// 0x0204 (0x0004) [0x0000000000004001] [0x00000008] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseBackgroundLevelStreaming : 1;                 		// 0x0204 (0x0004) [0x0000000000004001] [0x00000010] ( CPF_Edit | CPF_Config )
	unsigned long                                      bSubtitlesEnabled : 1;                            		// 0x0204 (0x0004) [0x0000000000004001] [0x00000020] ( CPF_Edit | CPF_Config )
	unsigned long                                      bSubtitlesForcedOff : 1;                          		// 0x0204 (0x0004) [0x0000000000004001] [0x00000040] ( CPF_Edit | CPF_Config )
	unsigned long                                      bForceStaticTerrain : 1;                          		// 0x0204 (0x0004) [0x0000000000004001] [0x00000080] ( CPF_Edit | CPF_Config )
	unsigned long                                      DisplayLazyLoadErrors : 1;                        		// 0x0204 (0x0004) [0x0000000000004000] [0x00000100] ( CPF_Config )
	unsigned long                                      m_bSaveInitialized : 1;                           		// 0x0204 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bForceCPUSkinning : 1;                            		// 0x0204 (0x0004) [0x0000000000004000] [0x00000400] ( CPF_Config )
	unsigned long                                      bUsePostProcessEffects : 1;                       		// 0x0204 (0x0004) [0x0000000000004000] [0x00000800] ( CPF_Config )
	unsigned long                                      bOnScreenKismetWarnings : 1;                      		// 0x0204 (0x0004) [0x0000000000004000] [0x00001000] ( CPF_Config )
	unsigned long                                      bEnableKismetLogging : 1;                         		// 0x0204 (0x0004) [0x0000000000004000] [0x00002000] ( CPF_Config )
	unsigned long                                      bAllowMatureLanguage : 1;                         		// 0x0204 (0x0004) [0x0000000000004000] [0x00004000] ( CPF_Config )
	unsigned long                                      bEnableVSMShadows : 1;                            		// 0x0204 (0x0004) [0x0000000000004000] [0x00008000] ( CPF_Config )
	unsigned long                                      bEnableBranchingPCFShadows : 1;                   		// 0x0204 (0x0004) [0x0000000000004000] [0x00010000] ( CPF_Config )
	unsigned long                                      bAllowBetterModulatedShadows : 1;                 		// 0x0204 (0x0004) [0x0000000000004000] [0x00020000] ( CPF_Config )
	unsigned long                                      bRenderTerrainCollisionAsOverlay : 1;             		// 0x0204 (0x0004) [0x0000000000004000] [0x00040000] ( CPF_Config )
	unsigned long                                      bDisablePhysXHardwareSupport : 1;                 		// 0x0204 (0x0004) [0x0000000000004000] [0x00080000] ( CPF_Config )
	unsigned long                                      bPauseOnLossOfFocus : 1;                          		// 0x0204 (0x0004) [0x0000000000004000] [0x00100000] ( CPF_Config )
	unsigned long                                      bEnableColorClear : 1;                            		// 0x0204 (0x0004) [0x0000000000044002] [0x00200000] ( CPF_Const | CPF_Config | CPF_GlobalConfig )
	float                                              MaxPixelShaderAdditiveComplexityCount;            		// 0x0208 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              MaxPixelShaderOpaqueComplexityCount;              		// 0x020C (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              MaxVertexShaderComplexityCount;                   		// 0x0210 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              MinTextureDensity;                                		// 0x0214 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              IdealTextureDensity;                              		// 0x0218 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              MaxTextureDensity;                                		// 0x021C (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	class UMaterial*                                   EditorBrushMaterial;                              		// 0x0220 (0x0004) [0x0000000000000000]              
	struct FString                                     EditorBrushMaterialName;                          		// 0x0224 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UPhysicalMaterial*                           DefaultPhysMaterial;                              		// 0x0230 (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultPhysMaterialName;                          		// 0x0234 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   TerrainErrorMaterial;                             		// 0x0240 (0x0004) [0x0000000000000000]              
	struct FString                                     TerrainErrorMaterialName;                         		// 0x0244 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	int                                                TerrainMaterialMaxTextureCount;                   		// 0x0250 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	int                                                TerrainTessellationCheckCount;                    		// 0x0254 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              TerrainTessellationCheckDistance;                 		// 0x0258 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	class UClass*                                      OnlineSubsystemClass;                             		// 0x025C (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultOnlineSubsystemName;                       		// 0x0260 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UPostProcessChain*                           DefaultPostProcess;                               		// 0x026C (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultPostProcessName;                           		// 0x0270 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UPostProcessChain*                           ThumbnailSkeletalMeshPostProcess;                 		// 0x027C (0x0004) [0x0000000000000000]              
	struct FString                                     ThumbnailSkeletalMeshPostProcessName;             		// 0x0280 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UPostProcessChain*                           ThumbnailParticleSystemPostProcess;               		// 0x028C (0x0004) [0x0000000000000000]              
	struct FString                                     ThumbnailParticleSystemPostProcessName;           		// 0x0290 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UPostProcessChain*                           ThumbnailMaterialPostProcess;                     		// 0x029C (0x0004) [0x0000000000000000]              
	struct FString                                     ThumbnailMaterialPostProcessName;                 		// 0x02A0 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UPostProcessChain*                           DefaultUIScenePostProcess;                        		// 0x02AC (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultUIScenePostProcessName;                    		// 0x02B0 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UMaterial*                                   DefaultUICaretMaterial;                           		// 0x02BC (0x0004) [0x0000000000000000]              
	struct FString                                     DefaultUICaretMaterialName;                       		// 0x02C0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   SceneCaptureReflectActorMaterial;                 		// 0x02CC (0x0004) [0x0000000000000000]              
	struct FString                                     SceneCaptureReflectActorMaterialName;             		// 0x02D0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UMaterial*                                   SceneCaptureCubeActorMaterial;                    		// 0x02DC (0x0004) [0x0000000000000000]              
	struct FString                                     SceneCaptureCubeActorMaterialName;                		// 0x02E0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	class UTexture2D*                                  RandomAngleTexture;                               		// 0x02EC (0x0004) [0x0000000000000000]              
	struct FString                                     RandomAngleTextureName;                           		// 0x02F0 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	float                                              TimeBetweenPurgingPendingKillObjects;             		// 0x02FC (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	class UClient*                                     Client;                                           		// 0x0300 (0x0004) [0x0000000000000002]              ( CPF_Const )
	TArray< class ULocalPlayer* >                      GamePlayers;                                      		// 0x0304 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UGameViewportClient*                         GameViewport;                                     		// 0x0310 (0x0004) [0x0000000000000002]              ( CPF_Const )
	TArray< struct FString >                           DeferredCommands;                                 		// 0x0314 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           NextFrameDeferredCommands;                        		// 0x0320 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                TickCycles;                                       		// 0x032C (0x0004) [0x0000000000000000]              
	int                                                GameCycles;                                       		// 0x0330 (0x0004) [0x0000000000000000]              
	int                                                ClientCycles;                                     		// 0x0334 (0x0004) [0x0000000000000000]              
	class UDebugManager*                               DebugManager;                                     		// 0x0338 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FPointer                                    RemoteControlExec;                                		// 0x033C (0x0004) [0x0000000000001000]              ( CPF_Native )
	struct FColor                                      C_WorldBox;                                       		// 0x0340 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_BrushWire;                                      		// 0x0344 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_AddWire;                                        		// 0x0348 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_SubtractWire;                                   		// 0x034C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_SemiSolidWire;                                  		// 0x0350 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_NonSolidWire;                                   		// 0x0354 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_WireBackground;                                 		// 0x0358 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_ScaleBoxHi;                                     		// 0x035C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_VolumeCollision;                                		// 0x0360 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_BSPCollision;                                   		// 0x0364 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_OrthoBackground;                                		// 0x0368 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      C_Volume;                                         		// 0x036C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              StreamingDistanceFactor;                          		// 0x0370 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ScoutClassName;                                   		// 0x0374 (0x000C) [0x0000000000404002]              ( CPF_Const | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FBioLayerDetails >                  m_BioLayerDetails;                                		// 0x0380 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FString                                     TransitionDescription;                            		// 0x038C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     TransitionGameType;                               		// 0x0398 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              MeshLODRange;                                     		// 0x03A4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ShadowFilterRadius;                               		// 0x03A8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              DepthBias;                                        		// 0x03AC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ModShadowFadeDistanceExponent;                    		// 0x03B0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              CameraFOVThreshold;                               		// 0x03B4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              CameraRotationThreshold;                          		// 0x03B8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              CameraTranslationThreshold;                       		// 0x03BC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              PrimitiveProbablyVisibleTime;                     		// 0x03C0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              PercentUnoccludedRequeries;                       		// 0x03C4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ShadowVolumeLightRadiusThreshold;                 		// 0x03C8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ShadowVolumePrimitiveScreenSpacePercentageThreshold;		// 0x03CC (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                MaxParticleResize;                                		// 0x03D0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                MaxParticleResizeWarn;                            		// 0x03D4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	class UMaterial*                                   TerrainCollisionMaterial;                         		// 0x03D8 (0x0004) [0x0000000000000000]              
	struct FString                                     TerrainCollisionMaterialName;                     		// 0x03DC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	int                                                BeginUPTryCount;                                  		// 0x03E8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	TArray< struct FDropNoteInfo >                     PendingDroppedNotes;                              		// 0x03EC (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FString                                     DynamicCoverMeshComponentName;                    		// 0x03F8 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	float                                              NetClientTicksPerSecond;                          		// 0x0404 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              LensFlareMaxOcclusionIncrement;                   		// 0x0408 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              LensFlareOcclusionStepSize;                       		// 0x040C (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	class UBioTestFramework*                           m_pUnitTestFramework;                             		// 0x0410 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 51 ];

		return pClassPointer;
	};

	void BioShowDebugMessageBox ( struct FString sMessage );
	void AddOverlayWrapped ( class UFont* Font, struct FString Text, float X, float Y, float ScaleX, float ScaleY, float WrapWidth );
	void AddOverlay ( class UFont* Font, struct FString Text, float X, float Y, float ScaleX, float ScaleY, unsigned long bIsCentered );
	void RemoveAllOverlays ( );
	void StopMovie ( );
	bool PlayLoadMapMovie ( );
	struct FString GetLastMovieName ( );
	class UAudioDevice* GetAudioDevice ( );
	bool IsSplitScreen ( );
	class UFont* GetAdditionalFont ( int AdditionalFontIndex );
	class UFont* GetLargeFont ( );
	class UFont* GetMediumFont ( );
	class UFont* GetSmallFont ( );
	class UFont* GetTinyFont ( );
	class AWorldInfo* GetCurrentWorldInfo ( );
	bool IsShip ( );
};

UClass* UEngine::pClassPointer = NULL;

// Class Engine.GameEngine
// 0x0128 (0x053C - 0x0414)
class UGameEngine : public UEngine
{
public:
	unsigned long                                      m_bPlayLogoMovie : 1;                             		// 0x0414 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      m_bIsLogoMovieInterruptable : 1;                  		// 0x0414 (0x0004) [0x0000000000004000] [0x00000002] ( CPF_Config )
	unsigned long                                      bShouldCommitPendingMapChange : 1;                		// 0x0414 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	unsigned long                                      bShouldSkipLevelStartupEventOnMapCommit : 1;      		// 0x0414 (0x0004) [0x0000000000000002] [0x00000008] ( CPF_Const )
	unsigned long                                      bShouldSkipLevelBeginningEventOnMapCommit : 1;    		// 0x0414 (0x0004) [0x0000000000000002] [0x00000010] ( CPF_Const )
	unsigned long                                      bSmoothFrameRate : 1;                             		// 0x0414 (0x0004) [0x0000000000004000] [0x00000020] ( CPF_Config )
	unsigned long                                      bClearAnimSetLinkupCachesOnLoadMap : 1;           		// 0x0414 (0x0004) [0x0000000000004000] [0x00000040] ( CPF_Config )
	unsigned long                                      m_bPlayedLogoMovie : 1;                           		// 0x0414 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	class UPendingLevel*                               GPendingLevel;                                    		// 0x0418 (0x0004) [0x0000000000000000]              
	struct FURL                                        LastURL;                                          		// 0x041C (0x0044) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FURL                                        LastRemoteURL;                                    		// 0x0460 (0x0044) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           ServerActors;                                     		// 0x04A4 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FString                                     TravelURL;                                        		// 0x04B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      TravelType;                                       		// 0x04BC (0x0001) [0x0000000000000000]              
	class UOnlineSubsystem*                            OnlineSubsystem;                                  		// 0x04C0 (0x0004) [0x0000000000000000]              
	TArray< struct FName >                             LevelsToLoadForPendingMapChange;                  		// 0x04C4 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	TArray< class ULevel* >                            LoadedLevelsForPendingMapChange;                  		// 0x04D0 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	struct FString                                     PendingMapChangeFailureDescription;               		// 0x04DC (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	float                                              MaxSmoothedFrameRate;                             		// 0x04E8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              MinSmoothedFrameRate;                             		// 0x04EC (0x0004) [0x0000000000004000]              ( CPF_Config )
	TArray< struct FLevelStreamingStatus >             PendingLevelStreamingStatusUpdates;               		// 0x04F0 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	TArray< class UObjectReferencer* >                 ObjectReferencers;                                		// 0x04FC (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	TArray< struct FFullyLoadedPackagesInfo >          PackagesToFullyLoad;                              		// 0x0508 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             DefaultPackagesToLoadPerMap;                      		// 0x0514 (0x000C) [0x0000000000406000]              ( CPF_Transient | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FPerMapExclusionPackagesInfo >      PackagesToExcludePerMap;                          		// 0x0520 (0x000C) [0x0000000000406000]              ( CPF_Transient | CPF_Config | CPF_NeedCtorLink )
	TArray< class UBioGlobalObjectContainer* >         GlobalPackagesLoaded;                             		// 0x052C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                m_nSkipFrames;                                    		// 0x0538 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 52 ];

		return pClassPointer;
	};

	class UOnlineSubsystem* GetOnlineSubsystem ( );
	void SkipFrames ( int nFrames );
};

UClass* UGameEngine::pClassPointer = NULL;

// Class Engine.Actor
// 0x01C0 (0x01FC - 0x003C)
class AActor : public UObject
{
public:
	TArray< class UActorComponent* >                   Components;                                       		// 0x003C (0x000C) [0x000000000448000A]              ( CPF_Const | CPF_ExportObject | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	TArray< class USFXModule* >                        Modules;                                          		// 0x0048 (0x000C) [0x000000000440000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	class UBioBaseComponent*                           ActorType;                                        		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioBaseComponent*                           oBioComponent;                                    		// 0x0058 (0x0004) [0x000000000440000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	TArray< class UActorComponent* >                   AllComponents;                                    		// 0x005C (0x000C) [0x000000000448200A]              ( CPF_Const | CPF_ExportObject | CPF_Transient | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	struct FRenderCommandFence                         DetachFence;                                      		// 0x0068 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	float                                              CustomTimeDilation;                               		// 0x006C (0x0004) [0x0000000000000000]              
	TArray< class UTexture2D* >                        PrimedTextures;                                   		// 0x0070 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      Physics;                                          		// 0x007C (0x0001) [0x0000000000000023]              ( CPF_Edit | CPF_Const | CPF_Net )
	unsigned char                                      RemoteRole;                                       		// 0x007D (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      Role;                                             		// 0x007E (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      RenderGroupHint;                                  		// 0x007F (0x0001) [0x0000000020000001]              ( CPF_Edit | CPF_Deprecated )
	unsigned char                                      TickGroup;                                        		// 0x0080 (0x0001) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      m_eRadarType;                                     		// 0x0081 (0x0001) [0x0000000020000001]              ( CPF_Edit | CPF_Deprecated )
	class AActor*                                      Owner;                                            		// 0x0084 (0x0004) [0x0000000000000022]              ( CPF_Const | CPF_Net )
	class AActor*                                      Base;                                             		// 0x0088 (0x0004) [0x0000000000000023]              ( CPF_Edit | CPF_Const | CPF_Net )
	TArray< struct FTimerData >                        Timers;                                           		// 0x008C (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	unsigned long                                      bStatic : 1;                                      		// 0x0098 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned long                                      bHidden : 1;                                      		// 0x0098 (0x0004) [0x0000000000000023] [0x00000002] ( CPF_Edit | CPF_Const | CPF_Net )
	unsigned long                                      bNoDelete : 1;                                    		// 0x0098 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	unsigned long                                      bDeleteMe : 1;                                    		// 0x0098 (0x0004) [0x0000000000000002] [0x00000008] ( CPF_Const )
	unsigned long                                      bOnlyOwnerSee : 1;                                		// 0x0098 (0x0004) [0x0000000000000002] [0x00000010] ( CPF_Const )
	unsigned long                                      bWorldGeometry : 1;                               		// 0x0098 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bIgnoreRigidBodyPawns : 1;                        		// 0x0098 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bOrientOnSlope : 1;                               		// 0x0098 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bIgnoreEncroachers : 1;                           		// 0x0098 (0x0004) [0x0000000000000002] [0x00000100] ( CPF_Const )
	unsigned long                                      bPushedByEncroachers : 1;                         		// 0x0098 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bDestroyedByInterpActor : 1;                      		// 0x0098 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bRouteBeginPlayEvenIfStatic : 1;                  		// 0x0098 (0x0004) [0x0000000000000002] [0x00000800] ( CPF_Const )
	unsigned long                                      bIsMoving : 1;                                    		// 0x0098 (0x0004) [0x0000000000000002] [0x00001000] ( CPF_Const )
	unsigned long                                      bAlwaysEncroachCheck : 1;                         		// 0x0098 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bHasAlternateTargetLocation : 1;                  		// 0x0098 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bNetTemporary : 1;                                		// 0x0098 (0x0004) [0x0000000000000002] [0x00008000] ( CPF_Const )
	unsigned long                                      bOnlyRelevantToOwner : 1;                         		// 0x0098 (0x0004) [0x0000000000000002] [0x00010000] ( CPF_Const )
	unsigned long                                      bAlwaysRelevant : 1;                              		// 0x0098 (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bReplicateInstigator : 1;                         		// 0x0098 (0x0004) [0x0000000000000000] [0x00040000] 
	unsigned long                                      bReplicateMovement : 1;                           		// 0x0098 (0x0004) [0x0000000000000000] [0x00080000] 
	unsigned long                                      bSkipActorPropertyReplication : 1;                		// 0x0098 (0x0004) [0x0000000000000000] [0x00100000] 
	unsigned long                                      bUpdateSimulatedPosition : 1;                     		// 0x0098 (0x0004) [0x0000000000000000] [0x00200000] 
	unsigned long                                      bTearOff : 1;                                     		// 0x0098 (0x0004) [0x0000000000000020] [0x00400000] ( CPF_Net )
	unsigned long                                      bOnlyDirtyReplication : 1;                        		// 0x0098 (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      bDemoOwner : 1;                                   		// 0x0098 (0x0004) [0x0000000000000000] [0x01000000] 
	unsigned long                                      bNetInitialRotation : 1;                          		// 0x0098 (0x0004) [0x0000000000000002] [0x02000000] ( CPF_Const )
	unsigned long                                      bReplicateRigidBodyLocation : 1;                  		// 0x0098 (0x0004) [0x0000000000000000] [0x04000000] 
	unsigned long                                      bKillDuringLevelTransition : 1;                   		// 0x0098 (0x0004) [0x0000000000000000] [0x08000000] 
	unsigned long                                      bExchangedRoles : 1;                              		// 0x0098 (0x0004) [0x0000000000000002] [0x10000000] ( CPF_Const )
	unsigned long                                      bConsiderAllStaticMeshComponentsForStreaming : 1; 		// 0x0098 (0x0004) [0x0000000000000001] [0x20000000] ( CPF_Edit )
	unsigned long                                      bDebug : 1;                                       		// 0x0098 (0x0004) [0x0000000000000001] [0x40000000] ( CPF_Edit )
	unsigned long                                      bPostRenderIfNotVisible : 1;                      		// 0x0098 (0x0004) [0x0000000000000000] [0x80000000] 
	unsigned long                                      bHardAttach : 1;                                  		// 0x009C (0x0004) [0x0000000000000023] [0x00000001] ( CPF_Edit | CPF_Const | CPF_Net )
	unsigned long                                      bIgnoreBaseRotation : 1;                          		// 0x009C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bShadowParented : 1;                              		// 0x009C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bCanBeAdheredTo : 1;                              		// 0x009C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bCanBeFrictionedTo : 1;                           		// 0x009C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bBioSnapToBase : 1;                               		// 0x009C (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      m_bBioBoneDependsOnBaseSkel : 1;                  		// 0x009C (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bHurtEntry : 1;                                   		// 0x009C (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bGameRelevant : 1;                                		// 0x009C (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bMovable : 1;                                     		// 0x009C (0x0004) [0x0000000000000002] [0x00000200] ( CPF_Const )
	unsigned long                                      bDestroyInPainVolume : 1;                         		// 0x009C (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bCanBeDamaged : 1;                                		// 0x009C (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bShouldBaseAtStartup : 1;                         		// 0x009C (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bPendingDelete : 1;                               		// 0x009C (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bCanTeleport : 1;                                 		// 0x009C (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bAlwaysTick : 1;                                  		// 0x009C (0x0004) [0x0000000000000002] [0x00008000] ( CPF_Const )
	unsigned long                                      bBlocksNavigation : 1;                            		// 0x009C (0x0004) [0x0000000000000001] [0x00010000] ( CPF_Edit )
	unsigned long                                      bCollideWhenPlacing : 1;                          		// 0x009C (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bCollideActors : 1;                               		// 0x009C (0x0004) [0x0000000000000022] [0x00040000] ( CPF_Const | CPF_Net )
	unsigned long                                      bCollideWorld : 1;                                		// 0x009C (0x0004) [0x0000000000000020] [0x00080000] ( CPF_Net )
	unsigned long                                      bCollideComplex : 1;                              		// 0x009C (0x0004) [0x0000000000000001] [0x00100000] ( CPF_Edit )
	unsigned long                                      bBlockActors : 1;                                 		// 0x009C (0x0004) [0x0000000000000020] [0x00200000] ( CPF_Net )
	unsigned long                                      bProjTarget : 1;                                  		// 0x009C (0x0004) [0x0000000000000020] [0x00400000] ( CPF_Net )
	unsigned long                                      bBlocksTeleport : 1;                              		// 0x009C (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      bNoEncroachCheck : 1;                             		// 0x009C (0x0004) [0x0000000000000001] [0x01000000] ( CPF_Edit )
	unsigned long                                      bPhysRigidBodyOutOfWorldCheck : 1;                		// 0x009C (0x0004) [0x0000000000000001] [0x02000000] ( CPF_Edit )
	unsigned long                                      bComponentOutsideWorld : 1;                       		// 0x009C (0x0004) [0x0000000000000002] [0x04000000] ( CPF_Const )
	unsigned long                                      bBounce : 1;                                      		// 0x009C (0x0004) [0x0000000000000000] [0x08000000] 
	unsigned long                                      bJustTeleported : 1;                              		// 0x009C (0x0004) [0x0000000000000002] [0x10000000] ( CPF_Const )
	unsigned long                                      bNetInitial : 1;                                  		// 0x009C (0x0004) [0x0000000000000002] [0x20000000] ( CPF_Const )
	unsigned long                                      bNetOwner : 1;                                    		// 0x009C (0x0004) [0x0000000000000022] [0x40000000] ( CPF_Const | CPF_Net )
	unsigned long                                      bHiddenEd : 1;                                    		// 0x009C (0x0004) [0x0000000000000003] [0x80000000] ( CPF_Edit | CPF_Const )
	unsigned long                                      bHiddenEdGroup : 1;                               		// 0x00A0 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      bHiddenEdCustom : 1;                              		// 0x00A0 (0x0004) [0x0000000000000002] [0x00000002] ( CPF_Const )
	unsigned long                                      bEdShouldSnap : 1;                                		// 0x00A0 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bPathColliding : 1;                               		// 0x00A0 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bScriptInitialized : 1;                           		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bLockLocation : 1;                                		// 0x00A0 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      bTickDuringPlayersOnly : 1;                       		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bNoTick : 1;                                      		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      m_bCombatStasis : 1;                              		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      m_bRadarDisabled : 1;                             		// 0x00A0 (0x0004) [0x0000000020000001] [0x00000200] ( CPF_Edit | CPF_Deprecated )
	unsigned long                                      m_bWasInVehicleTransition : 1;                    		// 0x00A0 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      m_bAlwaysCollide : 1;                             		// 0x00A0 (0x0004) [0x0000000000000002] [0x00000800] ( CPF_Const )
	unsigned long                                      OverridePhysMat : 1;                              		// 0x00A0 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      bTicked : 1;                                      		// 0x00A0 (0x0004) [0x0000000000002002] [0x00002000] ( CPF_Const | CPF_Transient )
	unsigned long                                      bStasis : 1;                                      		// 0x00A0 (0x0004) [0x0000000000002000] [0x00004000] ( CPF_Transient )
	unsigned long                                      bNetDirty : 1;                                    		// 0x00A0 (0x0004) [0x0000000000002000] [0x00008000] ( CPF_Transient )
	unsigned long                                      bDemoRecording : 1;                               		// 0x00A0 (0x0004) [0x0000000000002000] [0x00010000] ( CPF_Transient )
	unsigned long                                      bForceNetUpdate : 1;                              		// 0x00A0 (0x0004) [0x0000000000002000] [0x00020000] ( CPF_Transient )
	unsigned long                                      bPendingNetUpdate : 1;                            		// 0x00A0 (0x0004) [0x0000000000002002] [0x00040000] ( CPF_Const | CPF_Transient )
	unsigned long                                      BlockRigidBody : 1;                               		// 0x00A0 (0x0004) [0x0000000000002003] [0x00080000] ( CPF_Edit | CPF_Const | CPF_Transient )
	unsigned long                                      m_bIsChangingCollision : 1;                       		// 0x00A0 (0x0004) [0x0000000000002000] [0x00100000] ( CPF_Transient )
	unsigned long                                      bTempEditor : 1;                                  		// 0x00A0 (0x0004) [0x0000000000002002] [0x00200000] ( CPF_Const | CPF_Transient )
	unsigned long                                      bPathTemp : 1;                                    		// 0x00A0 (0x0004) [0x0000000000002000] [0x00400000] ( CPF_Transient )
	int                                                NetTag;                                           		// 0x00A4 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              NetUpdateTime;                                    		// 0x00A8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              NetUpdateFrequency;                               		// 0x00AC (0x0004) [0x0000000000000000]              
	float                                              NetPriority;                                      		// 0x00B0 (0x0004) [0x0000000000000000]              
	float                                              LastNetUpdateTime;                                		// 0x00B4 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
