/*
#############################################################################################
# Mass Effect 2 (1.2.1604.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SFXGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SFXGame.BioBaseAppearance.MorphFeatureModelType
// 0x0010
struct FMorphFeatureModelType
{
	struct FName                                       sFeatureName;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	class USkeletalMeshComponent*                      MinModel;                                         		// 0x0008 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      MaxModel;                                         		// 0x000C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
};

// ScriptStruct SFXGame.BioBaseAppearance.MorphFeatureType
// 0x0008
struct FMorphFeatureType
{
	struct FName                                       sFeatureName;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternValue
// 0x004C
struct FPlayerCustomPatternValue
{
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0000 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioDefine.PlayerCustomPatternValue.PatternName
	struct FName                                       Stripe1ParameterName;                             		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe1ParameterValue;                            		// 0x000C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ParameterName;                             		// 0x001C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ParameterValue;                            		// 0x0024 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ParameterName;                             		// 0x0034 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ParameterValue;                            		// 0x003C (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternColorValue
// 0x004C
struct FPlayerCustomPatternColorValue
{
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0000 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioDefine.PlayerCustomPatternColorValue.ColorName
	struct FName                                       Stripe1ColorName;                                 		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe1ColorValue;                                		// 0x000C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ColorName;                                 		// 0x001C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ColorValue;                                		// 0x0024 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ColorName;                                 		// 0x0034 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ColorValue;                                		// 0x003C (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomSpecValue
// 0x003C
struct FPlayerCustomSpecValue
{
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0000 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioDefine.PlayerCustomSpecValue.SpecName
	struct FScalarParameterValue                       Spec;                                             		// 0x0004 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FScalarParameterValue                       SpecPwr;                                          		// 0x0020 (0x001C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor1Value
// 0x0034
struct FPlayerCustomColor1Value
{
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0000 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioDefine.PlayerCustomColor1Value.ColorName
	struct FName                                       ParameterName;                                    		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                ParameterValue;                                   		// 0x000C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       PhongParameterName;                               		// 0x001C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                PhongParameterValue;                              		// 0x0024 (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor2Value
// 0x001C
struct FPlayerCustomColor2Value
{
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0000 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioDefine.PlayerCustomColor2Value.ColorName
	struct FName                                       ParameterName;                                    		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                ParameterValue;                                   		// 0x000C (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor3Value
// 0x001C
struct FPlayerCustomColor3Value
{
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0000 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioDefine.PlayerCustomColor3Value.ColorName
	struct FName                                       ParameterName;                                    		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                ParameterValue;                                   		// 0x000C (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerMeshInfo
// 0x0064
struct FPlayerMeshInfo
{
	struct FString                                     Male;                                             		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleVisor;                                        		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleFaceplate;                                    		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleMaterialOverride;                             		// 0x0024 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Female;                                           		// 0x0030 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleVisor;                                      		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleFaceplate;                                  		// 0x0048 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleMaterialOverride;                           		// 0x0054 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bHasBreather : 1;                                 		// 0x0060 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bHideHead : 1;                                    		// 0x0060 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bHideHair : 1;                                    		// 0x0060 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerSpecInfo
// 0x0038
struct FPlayerSpecInfo
{
	struct FScalarParameterValue                       SpecParam;                                        		// 0x0000 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FScalarParameterValue                       SpecPwrParam;                                     		// 0x001C (0x001C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerTintInfo
// 0x0050
struct FPlayerTintInfo
{
	struct FVectorParameterValue                       TintParam;                                        		// 0x0000 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       PhongParam;                                       		// 0x0028 (0x0028) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerPatternInfo
// 0x0078
struct FPlayerPatternInfo
{
	struct FVectorParameterValue                       Stripe1Param;                                     		// 0x0000 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       Stripe2Param;                                     		// 0x0028 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       Stripe3Param;                                     		// 0x0050 (0x0028) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.CustomizableElement
// 0x0188
struct FCustomizableElement
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bCustomizable : 1;                                		// 0x0004 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                Name;                                             		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Description;                                      		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Type;                                             		// 0x0010 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerMeshInfo                             Mesh;                                             		// 0x0014 (0x0064) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FPlayerSpecInfo                             Spec;                                             		// 0x0078 (0x0038) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerTintInfo                             Tint;                                             		// 0x00B0 (0x0050) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerPatternInfo                          Pattern;                                          		// 0x0100 (0x0078) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FString >                           GameEffects;                                      		// 0x0178 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                PlotFlag;                                         		// 0x0184 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear_Settings.BioHeadGearComponentSettings
// 0x000C
struct FBioHeadGearComponentSettings
{
	int                                                m_nMeshIndex;                                     		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialIndex;                                 		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bUseBodyMaterialConfig : 1;                     		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHidden : 1;                                  		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bIsLoaded : 1;                                  		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character.LookAtBoneDef
// 0x0024
struct FLookAtBoneDef
{
	struct FName                                       m_nBoneName;                                      		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fLimit;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fUpDownLimit;                                   		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fDelay;                                         		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_nLookAxis;                                      		// 0x0014 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_nUpAxis;                                        		// 0x0015 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bSeparateUpDownLimit : 1;                       		// 0x0018 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bUseUpAxis : 1;                                 		// 0x0018 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bLookAtInverted : 1;                            		// 0x0018 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_bUpAxisInverted : 1;                            		// 0x0018 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	float                                              m_fSpeedFactor;                                   		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fConversationStrength;                          		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.ModelVariation
// 0x000C
struct FModelVariation
{
	int                                                NumVariations;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaterialsPerVariation;                            		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bHasHeadGear : 1;                               		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.ArmorTypes
// 0x0024
struct FArmorTypes
{
	unsigned char                                      ArmorType;                                        		// 0x0000 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	struct FName                                       m_meshPackageName;                                		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_materialPackageName;                            		// 0x000C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FModelVariation >                   Variations;                                       		// 0x0014 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UPhysicsAsset*                               ArmorPhysicsAsset;                                		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.WeaponAnimSpec
// 0x001C
struct FWeaponAnimSpec
{
	struct FString                                     AnimType;                                         		// 0x0000 (0x000C) [0x0000000000420003]              ( CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< class UAnimSet* >                          m_animSets;                                       		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAnimSet*                                    m_drawAnimSet;                                    		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.OverrideAnimTreeTemplate
// 0x0008
struct FOverrideAnimTreeTemplate
{
	unsigned char                                      eClassification;                                  		// 0x0000 (0x0001) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	class UAnimTree*                                   AnimTreeTemplate;                                 		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Head.BioCharacterHeadAppearanceMaterialConfig
// 0x000C
struct FBioCharacterHeadAppearanceMaterialConfig
{
	TArray< class UMaterialInterface* >                m_aMaterials;                                     		// 0x0000 (0x000C) [0x0000000000400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Head.BioWrinkleConfig
// 0x0010
struct FBioWrinkleConfig
{
	struct FString                                     WrinkleParameterName;                             		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  WrinkleTexture;                                   		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioFacePlateMeshSpec
// 0x0008
struct FBioFacePlateMeshSpec
{
	unsigned long                                      m_bHidesVisor : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	class USkeletalMesh*                               m_pMesh;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioHeadGearAppearanceModelSpec
// 0x000C
struct FBioHeadGearAppearanceModelSpec
{
	int                                                m_nMaterialConfigCount;                           		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialCountPerConfig;                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHairHidden : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadHidden : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bSuppressFacePlate : 1;                         		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_bSuppressVisor : 1;                             		// 0x0008 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioHeadGearAppearanceArmorSpec
// 0x0018
struct FBioHeadGearAppearanceArmorSpec
{
	unsigned char                                      m_eArmorType;                                     		// 0x0000 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	TArray< struct FBioHeadGearAppearanceModelSpec >   m_aModelSpec;                                     		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       m_nmPackage;                                      		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.AudioAPLStatePair
// 0x000C
struct FAudioAPLStatePair
{
	struct FName                                       m_nmAPLState;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   m_SoundCue;                                       		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.VFXAPLStatePair
// 0x0009
struct FVFXAPLStatePair
{
	struct FName                                       m_nmAPLState;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_VFXState;                                       		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.VisualEffectAttachment
// 0x0018
struct FVisualEffectAttachment
{
	class UBioVFXTemplate*                             m_oEffectTemplate;                                		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nmSocket;                                       		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FVFXAPLStatePair >                  m_States;                                         		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.StaticAttachments
// 0x000C
struct FStaticAttachments
{
	struct FName                                       BoneName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UStaticMesh*                                 StaticMesh;                                       		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioVisualEffect.InterpPropertyInfo
// 0x0008
struct FInterpPropertyInfo
{
	class UObject*                                     Outer;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Offset;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioVisualEffect.CachedInstanceParameter
// 0x001C
struct FCachedInstanceParameter
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              fCurrentValue;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	TArray< struct FInterpPropertyInfo >               OffsetInfo;                                       		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bInited : 1;                                      		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioActorBehavior.BioVOSettings
// 0x000C
struct FBioVOSettings
{
	struct FColor                                      cSubtitleColour;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      nSubtitleMode;                                    		// 0x0004 (0x0001) [0x0000000000000000]              
	unsigned long                                      bSuppressSubtitlesIfVO : 1;                       		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bAlert : 1;                                       		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioActorBehavior.BioDamageReporter
// 0x001C
struct FBioDamageReporter
{
	float                                              fShieldDamage;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fShieldDamageCapacity;                            		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fHealthDamage;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              fToxicDamage;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              fStabilityDamage;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fDamageResistance;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fToxicResistance;                                 		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAiController.EnemyInfo
// 0x0038
struct FEnemyInfo
{
	class APawn*                                       Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FVector                                     KnownLocation;                                    		// 0x0004 (0x000C) [0x0000000000000000]              
	struct FVector                                     InterpLocation;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	float                                              InterpTime;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	struct FCoverInfo                                  Cover;                                            		// 0x0020 (0x0008) [0x0000000000000000]              
	float                                              InitialSeenTime;                                  		// 0x0028 (0x0004) [0x0000000000000000]              
	float                                              LastSeenTime;                                     		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              LastFailedPathTime;                               		// 0x0030 (0x0004) [0x0000000000000000]              
	unsigned long                                      bVisible : 1;                                     		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAiController.DelayUpdateInfo
// 0x0014
struct FDelayUpdateInfo
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
	class APawn*                                       Pawn;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              UpdateTime;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FName                                       EventName;                                        		// 0x000C (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimCheckBlendOut.BioAnimCheckBlendOutNode
// 0x0008
struct FBioAnimCheckBlendOutNode
{
	class UAnimNodeBlendList*                          Node;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimCheckBlendOut.BioAnimCheckBlendOutPath
// 0x0010
struct FBioAnimCheckBlendOutPath
{
	TArray< struct FBioAnimCheckBlendOutNode >         Nodes;                                            		// 0x0000 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FPointer                                    Next;                                             		// 0x000C (0x0004) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioAnimMovementSync.BioAnimMovementSyncNode
// 0x0008
struct FBioAnimMovementSyncNode
{
	class UAnimNode*                                   Node;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	class UAnimNode*                                   NodeWeight;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlend_TurnInPlace.RotTransitionInfo
// 0x0008
struct FRotTransitionInfo
{
	float                                              RotationOffset;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ChildIndex;                                       		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAction.BlendTime
// 0x0008
struct FBlendTime
{
	unsigned char                                      m_eAnimNode;                                      		// 0x0000 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	float                                              m_fTime;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAim.BioAnimNodeBlendByAimLimits
// 0x0010
struct FBioAnimNodeBlendByAimLimits
{
	float                                              DegreesLeft;                                      		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesRight;                                     		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesUp;                                        		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesDown;                                      		// 0x000C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct SFXGame.BioAnimNodeBlendMultiAdditive.BioChildActivateData
// 0x0010
struct FBioChildActivateData
{
	unsigned long                                      bApplyData : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              fFinalWeight;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fRemainingTime;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              fTotalBlendTime;                                  		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendPoseAndGestures.BioChildPinData
// 0x0020
struct FBioChildPinData
{
	float                                              fEndBlendStartTime;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fEndTime;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      bPlayUntilNext : 1;                               		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< class UBioGestChainTree* >                 aChainedTrees;                                    		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bUseDynAnimSets : 1;                              		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendPoseAndGestures.BioEndBlendData
// 0x0008
struct FBioEndBlendData
{
	float                                              fEndBlendStartTime;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalar.BioScalarBlendParams
// 0x000C
struct FBioScalarBlendParams
{
	float                                              Min;                                              		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Peak;                                             		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Max;                                              		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalar.BioScalarPrecomputedValues
// 0x0008
struct FBioScalarPrecomputedValues
{
	float                                              fRangeLowerRatio;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fRangeUpperRatio;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalarBehavior.BioAnimScalarNodeChildDef
// 0x0014
struct FBioAnimScalarNodeChildDef
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FBioScalarBlendParams                       BlendParams;                                      		// 0x0008 (0x000C) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalarBehavior.BioAnimScalarNodeBehaviorDef
// 0x0024
struct FBioAnimScalarNodeBehaviorDef
{
	TArray< struct FBioAnimScalarNodeChildDef >        Children;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      BlendInstant : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              BlendPctPerSecond;                                		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              DefaultScalar;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FString                                     Description;                                      		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAnimNodeBlendState.BioAnimBlendParams
// 0x000D
struct FBioAnimBlendParams
{
	TArray< float >                                    BlendToChildTimes;                                		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned char                                      PlayMode;                                         		// 0x000C (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendStateBehavior.BioAnimStateNodeChildDef
// 0x001C
struct FBioAnimStateNodeChildDef
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              DefaultWeight;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FBioAnimBlendParams                         BlendParams;                                      		// 0x000C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAnimNodeBlendStateBehavior.BioAnimStateNodeBehaviorDef
// 0x0018
struct FBioAnimStateNodeBehaviorDef
{
	TArray< struct FBioAnimStateNodeChildDef >         Children;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAnimNodeSequenceByBoneRotation.AnimByRotation
// 0x0018
struct FAnimByRotation
{
	struct FRotator                                    DesiredRotation;                                  		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AnimName;                                         		// 0x000C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAnimSequence*                               AnimSeq;                                          		// 0x0014 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
};

// ScriptStruct SFXGame.BioAppearanceItemSophisticated.BioAppearanceItemSophisticatedVariant
// 0x0020
struct FBioAppearanceItemSophisticatedVariant
{
	int                                                m_Label;                                          		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimSet*                                    m_oWeaponAnimSet;                                 		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimTree*                                   m_oWeaponAnimTree;                                		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicsAsset*                               m_oPhysicsAsset;                                  		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USkeletalMesh*                               m_oModelMesh;                                     		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UMaterialInterface* >                m_aMaterials;                                     		// 0x0014 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAppearanceItemSophisticated.WeaponEffects
// 0x001C
struct FWeaponEffects
{
	class UBioVISWeapon*                               VisualImpactSet;                                  		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             vfxMuzzleFlash;                                   		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             vfxMuzzleFlash2;                                  		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             vfxTracer;                                        		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             vfxCoolDown;                                      		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             vfxSabotage;                                      		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             vfxReload;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAppearanceItemWeapon.BioAppearanceItemWeaponVFXSpec
// 0x000C
struct FBioAppearanceItemWeaponVFXSpec
{
	int                                                m_type;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_Damage;                                         		// 0x0004 (0x0001) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	class UBioWeaponVFXAppearance*                     m_appearance;                                     		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAppearanceVehicle.BioVehicleAttachmentInfo
// 0x0018
struct FBioVehicleAttachmentInfo
{
	class UActorComponent*                             oComponentToAttach;                               		// 0x0000 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FName                                       nmAttachSocket;                                   		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UMaterialInterface* >                aMeshMaterials;                                   		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAppearanceVehicle.BioVehicleTurretInfo
// 0x0028
struct FBioVehicleTurretInfo
{
	struct FName                                       nmAttachSocket;                                   		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       nmTurretYawBone;                                  		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       nmTurretPitchBone;                                		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       nmYawController;                                  		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       nmPitchController;                                		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAppearanceVehicle.BioVehicleThrusterInfo
// 0x0008
struct FBioVehicleThrusterInfo
{
	struct FName                                       nmThrusterSocket;                                 		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAppearanceVehicle.BioVehicleSoundEntityStateInfo
// 0x0018
struct FBioVehicleSoundEntityStateInfo
{
	struct FString                                     sStateName;                                       		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     sStateValue;                                      		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioGamePropertyTimer.BioGPTimingData
// 0x0010
struct FBioGPTimingData
{
	float                                              fTime;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class UBioGameProperty*                            oGP;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      eTimingType;                                      		// 0x0008 (0x0001) [0x0000000000000000]              
	unsigned long                                      bFrameTicked : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioGamePropertyManager.BioGamePropertyManagerTimedOutTicked
// 0x0008
struct FBioGamePropertyManagerTimedOutTicked
{
	class UBioGameProperty*                            m_pGP;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_fTimeRemaining;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioArtPlaceableRoles.ArtPlaceableProperty
// 0x0018
struct FArtPlaceableProperty
{
	struct FString                                     sPropertyName;                                    		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     sPropertyValue;                                   		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioArtPlaceableRoles.ArtPlaceableRole
// 0x0018
struct FArtPlaceableRole
{
	struct FString                                     sRoleName;                                        		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FArtPlaceableProperty >             aProperties;                                      		// 0x000C (0x000C) [0x0000000004400001]              ( CPF_Edit | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct SFXGame.BioAttributes.BioComplexIntStructAttribute
// 0x0074
struct FBioComplexIntStructAttribute
{
	int                                                m_Base;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_modifiers[ 0x4 ];                               		// 0x0004 (0x0010) [0x0000000000000000]              
	unsigned long                                      m_isBaseOverrideInEffect : 1;                     		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< int >                                      m_baseOverrides;                                  		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< unsigned long >                            m_isBaseOverrideValid;                            		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_Current;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_Dirty : 1;                                      		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_Max;                                            		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                m_Min;                                            		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                m_isModifierEnabled[ 0x4 ];                       		// 0x0040 (0x0010) [0x0000000000000000]              
	struct FPointer                                    m_Parent;                                         		// 0x0050 (0x0004) [0x0000000000001000]              ( CPF_Native )
	class UBio2DA*                                     m_LookupTable;                                    		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                m_TableColumn;                                    		// 0x0058 (0x0004) [0x0000000000000000]              
	TArray< struct FPointer >                          m_Children;                                       		// 0x005C (0x000C) [0x0000000000001000]              ( CPF_Native )
	TArray< struct FPointer >                          m_FloatChildren;                                  		// 0x0068 (0x000C) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioAttributes.BioComplexFloatStructAttribute
// 0x005C
struct FBioComplexFloatStructAttribute
{
	float                                              m_Base;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_modifiers[ 0x4 ];                               		// 0x0004 (0x0010) [0x0000000000000000]              
	unsigned long                                      m_isBaseOverrideInEffect : 1;                     		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< float >                                    m_baseOverrides;                                  		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< unsigned long >                            m_isBaseOverrideValid;                            		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_Current;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_Dirty : 1;                                      		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              m_Max;                                            		// 0x0038 (0x0004) [0x0000000000000000]              
	float                                              m_Min;                                            		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                m_isModifierEnabled[ 0x4 ];                       		// 0x0040 (0x0010) [0x0000000000000000]              
	struct FPointer                                    m_Parent;                                         		// 0x0050 (0x0004) [0x0000000000001000]              ( CPF_Native )
	class UBio2DA*                                     m_LookupTable;                                    		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                m_TableColumn;                                    		// 0x0058 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioBaseActivity.ActivityProp
// 0x000C
struct FActivityProp
{
	class UStaticMesh*                                 m_oStaticMesh;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nAttachlocation;                                		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseSquad.MemberData
// 0x0030
struct FMemberData
{
	class APawn*                                       SquadMember;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class ABioTacticalMoveToIndicator*                 oDestinationIndicator;                            		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bMoveOrderAssigned : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FName                                       nmPower;                                          		// 0x000C (0x0008) [0x0000000000000000]              
	struct FVector                                     vTarget;                                          		// 0x0014 (0x000C) [0x0000000000000000]              
	struct FVector                                     vHoldPosition;                                    		// 0x0020 (0x000C) [0x0000000000000000]              
	class AActor*                                      oOrderedAttackTarget;                             		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioProceduralCameraBasic.ActorInfo
// 0x0054
struct FActorInfo
{
	struct FVector                                     myPosition;                                       		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FRotator                                    myRotation;                                       		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     headBaseBonePosition;                             		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FVector                                     headBonePosition;                                 		// 0x0024 (0x000C) [0x0000000000000000]              
	struct FVector                                     vCameraFocusPoint;                                		// 0x0030 (0x000C) [0x0000000000000000]              
	struct FVector                                     vProceduralCameraPosition;                        		// 0x003C (0x000C) [0x0000000000000000]              
	struct FRotator                                    rProceduralCameraRotation;                        		// 0x0048 (0x000C) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioProceduralCameraBasic.CameraInfo
// 0x0020
struct FCameraInfo
{
	struct FVector                                     vPosition;                                        		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FRotator                                    rRotation;                                        		// 0x000C (0x000C) [0x0000000000000000]              
	float                                              fFov;                                             		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              fNearPlane;                                       		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioCameraBehaviorGalaxy.SFXGalaxyMapSelector
// 0x0024
struct FSFXGalaxyMapSelector
{
	class USFXGalaxyMapObject*                         m_GalaxyMapObject;                                		// 0x0000 (0x0004) [0x0000000000000000]              
	class AActor*                                      m_actor;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0008 (0x0004) UNKNOWN PROPERTY: StringRefProperty SFXGame.BioCameraBehaviorGalaxy.SFXGalaxyMapSelector.m_Name
	unsigned char                                      UnknownData01[ 0xC ];                             		// 0x000C (0x000C) UNKNOWN PROPERTY: ArrayProperty SFXGame.BioCameraBehaviorGalaxy.SFXGalaxyMapSelector.m_PlotNames
	unsigned long                                      m_Visible : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_Visited;                                        		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                m_State;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.SFXCameraModifier_ScreenShake.ShakeParams
// 0x0004
struct FShakeParams
{
	unsigned char                                      X;                                                		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Y;                                                		// 0x0001 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Z;                                                		// 0x0002 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Padding;                                          		// 0x0003 (0x0001) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
};

// ScriptStruct SFXGame.SFXCameraModifier_ScreenShake.ScreenShakeStruct
// 0x0070
struct FScreenShakeStruct
{
	float                                              TimeToGo;                                         		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              TimeDuration;                                     		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotAmplitude;                                     		// 0x0008 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotFrequency;                                     		// 0x0014 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotSinOffset;                                     		// 0x0020 (0x000C) [0x0000000000000000]              
	struct FShakeParams                                RotParam;                                         		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LocAmplitude;                                     		// 0x0030 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LocFrequency;                                     		// 0x003C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LocSinOffset;                                     		// 0x0048 (0x000C) [0x0000000000000000]              
	struct FShakeParams                                LocParam;                                         		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FOVAmplitude;                                     		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FOVFrequency;                                     		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
