/*
#############################################################################################
# Mass Effect 2 (1.2.1604.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SFXGameContent_Powers_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGameContent_Powers.SFXGameEffect_DamageBonus.OnRemoved
// [0x00020002] 
struct USFXGameEffect_DamageBonus_execOnRemoved_Parms
{
	// class USFXPower*                                oPower;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXGameEffect_DamageBonus.OnApplied
// [0x00020002] 
struct USFXGameEffect_DamageBonus_execOnApplied_Parms
{
	// class ABioPawn*                                 oPawn;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// class USFXPower*                                oPower;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_Overload_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sOptionalInfo;                                    		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.SpawnBigImpactVFX
// [0x00020002] 
struct USFXPowerScript_Overload_execSpawnBigImpactVFX_Parms
{
	class AActor*                                      oImpacted;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFXGame*                                 oGame;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASFXObjectPool*                           oPool;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	// class ABioPlayerController*                     pController;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	// class ABioVisualEffect*                         oVisualEffect;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.ExplodeEnemy
// [0x00020002] 
struct USFXPowerScript_Overload_execExplodeEnemy_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ABioPawn*                                    oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.CanEnemyBeExploded
// [0x00020002] 
struct USFXPowerScript_Overload_execCanEnemyBeExploded_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.TurnOnDeathPower
// [0x00020002] 
struct USFXPowerScript_Overload_execTurnOnDeathPower_Parms
{
	class AActor*                                      oImpacted;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.StunRobot
// [0x00020002] 
struct USFXPowerScript_Overload_execStunRobot_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFXAI_Core*                              AI;                                               		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           fStunLength;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.OnImpact
// [0x00820802] ( FUNC_Event )
struct USFXPowerScript_Overload_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Momentum;                                         		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           fDamage;                                          		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           fStunLength;                                      		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           fOverheatLength;                                  		// 0x0038 (0x0004) [0x0000000000000000]              
	// class UClass*                                   DamageClass;                                      		// 0x003C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bIsRobot : 1;                                     		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	// class USFXPower*                                StealthPower;                                     		// 0x0044 (0x0004) [0x0000000000000000]              
	// class ASFXShield_Base*                          ShieldCheck;                                      		// 0x0048 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bHadEnergyShields : 1;                            		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	// class ABioPlayerController*                     PC;                                               		// 0x0050 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Overload.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_Overload_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking_NPC.Tick
// [0x00820102] 
struct ASFXProjectile_Power_Seeking_NPC_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  DesiredOrientation;                               		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CurrentOrientation;                               		// 0x0010 (0x000C) [0x0000000000000000]              
	// float                                           fAngle;                                           		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           fTargetVelocity;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           fAngleChange;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	// struct FVector                                  Extent;                                           		// 0x0028 (0x000C) [0x0000000000000000]              
	// class ABioPawn*                                 oPawn;                                            		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking_NPC.GetAimLocation
// [0x00820002] 
struct ASFXProjectile_Power_Seeking_NPC_execGetAimLocation_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  AimLocation;                                      		// 0x0010 (0x000C) [0x0000000000000000]              
	// float                                           fDistance;                                        		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           fTimeToHit;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           fVelocity;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oPawn;                                            		// 0x0028 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking_NPC.InitializePowerProjectile
// [0x00020002] 
struct ASFXProjectile_Power_Seeking_NPC_execInitializePowerProjectile_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fTravelSpeed;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRadius;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UBioPower*                                   oPower;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bResult : 1;                                      		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function SFXGameContent_Powers.SFXPower_Incinerate_NPC.GetDamage
// [0x00020002] 
struct USFXPower_Incinerate_NPC_execGetDamage_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPower_Overload.GetOverheatLength
// [0x00020002] 
struct USFXPower_Overload_execGetOverheatLength_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPower_Overload.GetRobotStunLength
// [0x00020002] 
struct USFXPower_Overload_execGetRobotStunLength_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_Incinerate.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_Incinerate_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sOptionalInfo;                                    		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Incinerate.ExplodeEnemy
// [0x00020002] 
struct USFXPowerScript_Incinerate_execExplodeEnemy_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ABioPawn*                                    oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_Incinerate.CanEnemyBeExploded
// [0x00020002] 
struct USFXPowerScript_Incinerate_execCanEnemyBeExploded_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_Incinerate.CauseAnimatedReaction
// [0x00020002] 
struct USFXPowerScript_Incinerate_execCauseAnimatedReaction_Parms
{
	class AActor*                                      oHitActor;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDelay;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x000C (0x0004) [0x0000000000000000]              
	// class USFXGameEffect_DelayedCustomAction*       oEffect;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           Random;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_Incinerate.OnImpact
// [0x00820802] ( FUNC_Event )
struct USFXPowerScript_Incinerate_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oImpactedPawn;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x001C (0x0004) [0x0000000000000000]              
	// int                                             nLargeFlameCount;                                 		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           fFullDamage;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
	// float                                           fInstantDamage;                                   		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           fDoTDamage;                                       		// 0x002C (0x0004) [0x0000000000000000]              
	// float                                           fDelay;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0034 (0x000C) [0x0000000000000000]              
	// class ABioWorldInfo*                            pWorldInfo;                                       		// 0x0040 (0x0004) [0x0000000000000000]              
	// class ABioPlayerController*                     pController;                                      		// 0x0044 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bIsRobot : 1;                                     		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	// class ABioVisualEffect*                         Effect;                                           		// 0x004C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bHadArmor : 1;                                    		// 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function SFXGameContent_Powers.SFXPowerScript_Incinerate.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_Incinerate_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPower_Incinerate.GetDuration
// [0x00020002] 
struct USFXPower_Incinerate_execGetDuration_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_FirstAid.GetHUDWheelIconInfo
// [0x00020002] 
struct USFXPowerScript_FirstAid_execGetHUDWheelIconInfo_Parms
{
	class ABioPawn*                                    OwnerPawn;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// class UBioEpicPawnBehavior*                     oBehavior;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// class ABioPlayerSquad*                          oPlayerSquad;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             nCount;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_FirstAid.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_FirstAid_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sOptionalInfo;                                    		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 BioCaster;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	// class UBioEpicPawnBehavior*                     oBehavior;                                        		// 0x001C (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 BioMember;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
	// class ABioAiController*                         oController;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
	// class ABioPlayerSquad*                          oPlayerSquad;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_FirstAid.CountMediGel
// [0x00020002] 
struct USFXPowerScript_FirstAid_execCountMediGel_Parms
{
	class ABioPlayerSquad*                             oPlayerSquad;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFXInventoryManager*                     oInventory;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             nCurrentAmount;                                   		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_FirstAid.OnImpact
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_FirstAid_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 BioCaster;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 BioMember;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	// class ABioVisualEffect*                         Effect;                                           		// 0x001C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bActionTaken : 1;                                 		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bApplyCrust : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             nHealCount;                                       		// 0x0028 (0x0004) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_FirstAid.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_FirstAid_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_FirstAid.CanStartPower
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_FirstAid_eventCanStartPower_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FString                                  EmptyString;                                      		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.RemovePowerBonusEffect
// [0x00020002] 
struct USFXPowerScript_PassivePower_execRemovePowerBonusEffect_Parms
{
	class AActor*                                      oTarget;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      ClassName;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmCategory;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      PowerClass;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	// class USFXGameEffect_PowerBonus*                Effect;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyPowerBonusEffect
// [0x00020002] 
struct USFXPowerScript_PassivePower_execApplyPowerBonusEffect_Parms
{
	class AActor*                                      oTarget;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      ClassName;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fEffectValue;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmCategory;                                       		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      PowerClass;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	// class USFXGameEffect_PowerBonus*                Effect;                                           		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyHealthModifier
// [0x00020002] 
struct USFXPowerScript_PassivePower_execApplyHealthModifier_Parms
{
	float                                              fHealthModifier;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyWeaponDamageModifier
// [0x00020002] 
struct USFXPowerScript_PassivePower_execApplyWeaponDamageModifier_Parms
{
	float                                              fDamageModifier;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyPowerCooldownModifier
// [0x00020002] 
struct USFXPowerScript_PassivePower_execApplyPowerCooldownModifier_Parms
{
	float                                              fCooldownModifier;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyPassiveBonus
// [0x00020002] 
struct USFXPowerScript_PassivePower_execApplyPassiveBonus_Parms
{
	class UClass*                                      EffectClass;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fModifier;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyGlobalBonus
// [0x00020000] 
struct USFXPowerScript_PassivePower_execApplyGlobalBonus_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.OnSquadMemberAdded
// [0x00020002] 
struct USFXPowerScript_PassivePower_execOnSquadMemberAdded_Parms
{
	class APawn*                                       Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.OnPowersLoaded
// [0x00020002] 
struct USFXPowerScript_PassivePower_execOnPowersLoaded_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.OnPowerRankIncreased
// [0x00020002] 
struct USFXPowerScript_PassivePower_execOnPowerRankIncreased_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.InitializePowerScript
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_PassivePower_eventInitializePowerScript_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_EngineerPassive.ApplyGlobalBonus
// [0x00020002] 
struct USFXPowerScript_EngineerPassive_execApplyGlobalBonus_Parms
{
	// float                                           fCooldownReduction;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           fPowerDamageIncrease;                             		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fPowerDurationIncrease;                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           fResearchCostDecrease;                            		// 0x000C (0x0004) [0x0000000000000000]              
	// class USFXPower_EngineerPassive*                oPassivePower;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           fHealthIncrease;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.Recycle
// [0x00020102] 
struct ASFXProjectile_Power_Seeking_execRecycle_Parms
{
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.InitializeRotation
// [0x00020000] 
struct ASFXProjectile_Power_Seeking_execInitializeRotation_Parms
{
	class APawn*                                       oCasterPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.InitializePowerProjectile
// [0x00020002] 
struct ASFXProjectile_Power_Seeking_execInitializePowerProjectile_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fTravelSpeed;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRadius;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UBioPower*                                   oPower;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APawn*                                    oCasterPawn;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.CanLockOn
// [0x00020002] 
struct ASFXProjectile_Power_Seeking_execCanLockOn_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APawn*                                       CasterPawn;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AKActor*                                  oKActor;                                          		// 0x000C (0x0004) [0x0000000000000000]              
	// class USFXSelectionModule*                      Module;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oPawn;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.Tick
// [0x00820102] 
struct ASFXProjectile_Power_Seeking_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FQuat                                    Q;                                                		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FVector                                  V;                                                		// 0x0014 (0x000C) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.ShouldModifyVelocity
// [0x00020002] 
struct ASFXProjectile_Power_Seeking_execShouldModifyVelocity_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.ChordLength
// [0x00020003] ( FUNC_Final )
struct ASFXProjectile_Power_Seeking_execChordLength_Parms
{
	float                                              ChordLen;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Theta;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           CircleRadius;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.GetAimLocation
// [0x00820002] 
struct ASFXProjectile_Power_Seeking_execGetAimLocation_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  AimLocation;                                      		// 0x0010 (0x000C) [0x0000000000000000]              
	// class ABioPawn*                                 oPawn;                                            		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_Seeking.AcquireTarget
// [0x00820002] 
struct ASFXProjectile_Power_Seeking_execAcquireTarget_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  V;                                                		// 0x0004 (0x000C) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           RadsToTarget;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FQuat                                    Q;                                                		// 0x0018 (0x0010) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXProjectile_Power_SuperSeeking.InitializeRotation
// [0x00820002] 
struct ASFXProjectile_Power_SuperSeeking_execInitializeRotation_Parms
{
	class APawn*                                       oCasterPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ABioPlayerController*                     PC;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FRotator                                 Offset;                                           		// 0x0008 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CryoFreeze.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_CryoFreeze_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sOptionalInfo;                                    		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CryoFreeze.OnImpact
// [0x00820802] ( FUNC_Event )
struct USFXPowerScript_CryoFreeze_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oImpactedPawn;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x001C (0x000C) [0x0000000000000000]              
	// float                                           fFreezeDuration;                                  		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           fPhysLevelResistance;                             		// 0x002C (0x0004) [0x0000000000000000]              
	// float                                           fDelay;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0034 (0x0004) [0x0000000000000000]              
	// class USFXGameEffect_DelayedCryoFreeze*         FreezeEffect;                                     		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CryoFreeze.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CryoFreeze_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneDeath.OnImpact
// [0x00820802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneDeath_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFXGame*                                 oGame;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// class ASFXObjectPool*                           oPool;                                            		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FVector                                  DirectionToSprayParticles;                        		// 0x001C (0x000C) [0x0000000000000000]              
	// class AEmitter*                                 oEmitter;                                         		// 0x0028 (0x0004) [0x0000000000000000]              
	// class ASFXPawn_EngineerCombatDrone*             CombatDrone;                                      		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneDeath.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneDeath_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack_NPC.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_CombatDroneAttack_NPC_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sOptionalInfo;                                    		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack_NPC.OnImpact
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneAttack_NPC_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	// class ABioWorldInfo*                            pWorldInfo;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	// class ABioPlayerController*                     pController;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack_NPC.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneAttack_NPC_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_CombatDroneAttack_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sOptionalInfo;                                    		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack.OnImpact
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneAttack_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	// class ABioWorldInfo*                            pWorldInfo;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	// class ABioPlayerController*                     pController;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
	// class ASFXAI_Core*                              oController;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneAttack_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPower_Cloak_NPC.GetDamageMultiplier
// [0x00020002] 
struct USFXPower_Cloak_NPC_execGetDamageMultiplier_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_Cloak.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_Cloak_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
